1、查看存储引擎
show variables like '%storage_engine%';
+----------------------------------+--------+
| Variable_name                    | Value  |
+----------------------------------+--------+
| default_storage_engine           | InnoDB |
| default_tmp_storage_engine       | InnoDB |
| disabled_storage_engines         |        |
| enforce_storage_engine           |        |
| internal_tmp_disk_storage_engine | InnoDB |
+----------------------------------+--------+

2、MyISAM
主外键==========不支持
事务===========不支持
行表锁=========表锁，即使操作一条记录也锁表，不适合高并发
缓存===========只缓存索引，不缓存数据
表空间=========小
关注点=========性能（更适合读数据的场景）
默认安装========Y

3、InnoDB
主外键=========支持
事务===========支持
行表锁=========行锁，操作是只锁一行，对其他行没有影响，适合高并发
缓存===========缓存索引和数据，对内存要求高，内存大小决定性能
表空间==========大
关注点==========事务
默认安装=========Y

