1、SHOW PROCESSLIST 查看详细信息
+------+------+-----------------+-----------+---------+------+---------------------------------+---------------------------------+
| Id   | User | Host            | db        | Command | Time | State                           | Info                            |
+------+------+-----------------+-----------+---------+------+---------------------------------+---------------------------------+
| 4884 | root | localhost:64108 | mysqldemo | Sleep   | 2105 |                                 | NULL                            |
| 4892 | root | localhost       | mysqldemo | Query   |    0 | init                            | SHOW PROCESSLIST                |
| 4896 | root | localhost       | mysqldemo | Query   |   27 | Waiting for table metadata lock | INSERT INTO tbl(col) VALUES(21) |
+------+------+-----------------+-----------+---------+------+---------------------------------+---------------------------------+

2、
